Revit 2027 API
LoadCase.NatureId Property
 The nature ID of the load case.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NatureId { get; set; }
Public Property NatureId As ElementId
	Get
	Set
public:
property ElementId^ NatureId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member NatureId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: the natureId does not refer to LoadNature element.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace